In [1]:
import pandas as pd

In [2]:
# Create two dataframes
dataframe1 = pd.DataFrame({
    'Employee_ID': [101, 102],
    'Name': ['Alice', 'Bob'],
    'Department': ['HR', 'Finance']
})

dataframe2 = pd.DataFrame({
    'Employee_ID': [103, 104],
    'Name': ['Charlie', 'David'],
    'Department': ['Marketing', 'IT']
})

In [4]:
# Concatenate along rows
concatenated_rows = pd.concat([dataframe1, dataframe2], axis=0)

concatenated_rows

   Employee_ID     Name Department
0          101    Alice         HR
1          102      Bob    Finance
0          103  Charlie  Marketing
1          104    David         IT

In [5]:
# Create two dataframes
dataframe1 = pd.DataFrame({
    'Employee_ID': [101, 102],
    'Name': ['Alice', 'Bob']
})

dataframe2 = pd.DataFrame({
    'Salary': [50000, 60000],
    'Department': ['HR', 'Finance']
})

In [6]:
# Concatenate along columns
concatenated_columns = pd.concat([dataframe1, dataframe2], axis=1)

concatenated_columns

   Employee_ID   Name  Salary Department
0          101  Alice   50000         HR
1          102    Bob   60000    Finance

In [8]:
import pandas as pd

# Create two dataframes
dataframe1 = pd.DataFrame({
    'Employee_ID': [101, 102],
    'Name': ['Alice', 'Bob']
})

dataframe2 = pd.DataFrame({
    'Name': ['Charlie', 'David'],
    'Salary': [60000, 75000]
})

# Concatenate dataframes with missing values
concatenated_with_missing = pd.concat([dataframe1, dataframe2])

print(concatenated_with_missing)

   Employee_ID     Name   Salary
0        101.0    Alice      NaN
1        102.0      Bob      NaN
0          NaN  Charlie  60000.0
1          NaN    David  75000.0

In [9]:
# Create orders_data dataframe
orders_data = pd.DataFrame({
    'Order_ID': [101, 102, 103],
    'Customer_ID': [201, 202, 203],
    'Product': ['A', 'B', 'C']
})

# Create customers_data dataframe
customers_data = pd.DataFrame({
    'Customer_ID': [201, 202, 204],
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Location': ['New York', 'San Francisco', 'Los Angeles']
})

In [12]:
orders_data

   Order_ID  Customer_ID Product
0       101          201       A
1       102          202       B
2       103          203       C

In [13]:
customers_data

   Customer_ID     Name       Location
0          201    Alice       New York
1          202      Bob  San Francisco
2          204  Charlie    Los Angeles

In [11]:
# Perform inner join based on 'Customer_ID'
inner_join_result = pd.merge(orders_data, customers_data, on='Customer_ID', how='inner')

print(inner_join_result)

   Order_ID  Customer_ID Product   Name       Location
0       101          201       A  Alice       New York
1       102          202       B    Bob  San Francisco

In [20]:
# Create employees dataframe
employees = pd.DataFrame({
    'Employee_ID': [101, 102, 103, 104],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Department_ID': [1, 2, 1, 3]
})

# Create departments dataframe
departments = pd.DataFrame({
    'Department_ID': [1, 2, 4],
    'Department_Name': ['HR', 'Finance', 'Marketing']
})

employees

   Employee_ID     Name  Department_ID
0          101    Alice              1
1          102      Bob              2
2          103  Charlie              1
3          104    David              3

In [17]:
departments

   Department_ID Department_Name
0              1              HR
1              2         Finance
2              4       Marketing

In [18]:
# Perform an outer join based on 'Department_ID'
outer_joined = pd.merge(employees, departments, on='Department_ID', how='outer')

print(outer_joined)

   Employee_ID     Name  Department_ID Department_Name
0        101.0    Alice              1              HR
1        103.0  Charlie              1              HR
2        102.0      Bob              2         Finance
3        104.0    David              3             NaN
4          NaN      NaN              4       Marketing

In [22]:
# Perform left join based on 'Department_ID'
left_joined = pd.merge(employees, departments, on='Department_ID', how='left')

print(left_joined)

   Employee_ID     Name  Department_ID Department_Name
0          101    Alice              1              HR
1          102      Bob              2         Finance
2          103  Charlie              1              HR
3          104    David              3             NaN

In [24]:
right_joined = pd.merge(employees, departments, on='Department_ID', how='right')
right_joined

   Employee_ID     Name  Department_ID Department_Name
0        101.0    Alice              1              HR
1        103.0  Charlie              1              HR
2        102.0      Bob              2         Finance
3          NaN      NaN              4       Marketing

In [26]:
# Create students dataframe
students = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [21, 22, 20]
}, index=[101, 102, 103])

# Create scores dataframe
scores = pd.DataFrame({
    'Math': [95, 85, 78],
    'Science': [89, 92, 81]
    }, index=[101, 102, 104])  # Note the missing index 103

    students

        Name  Age
101    Alice   21
102      Bob   22
103  Charlie   20

In [27]:
scores

     Math  Science
101    95       89
102    85       92
104    78       81

In [28]:
    # Perform an inner join based on indices
    inner_joined = pd.merge(students, scores, left_index=True, right_index=True, how='inner')

    print("Inner Joined:")
    print(inner_joined)

Inner Joined:
      Name  Age  Math  Science
101  Alice   21    95       89
102    Bob   22    85       92

In [2]:
# Sample dataframes
students = pd.DataFrame({
    'StudentID': [1, 1, 2, 2],
    'Subject': ['Math', 'History', 'Math', 'History'],
    'Name': ['Alice', 'Alice', 'Bob', 'Bob']
})

scores = pd.DataFrame({
    'StudentID': [1, 1, 2, 2],
    'Subject': ['Math', 'History', 'Math', 'History'],
    'Score': [90, 85, 78, 88]
})

In [3]:
# Merging on multiple columns
merged_df = pd.merge(students, scores, on=['StudentID', 'Subject'], how='inner')
print(merged_df)

   StudentID  Subject   Name  Score
0          1     Math  Alice     90
1          1  History  Alice     85
2          2     Math    Bob     78
3          2  History    Bob     88